////////////////////////////////////////////////////////////////////////////////
// Модуль дополнительной внешней обработки открытия формы:
//
// - Изменения: 20.07.2022
// - Автор:     Иван (Ibrogim), Ibrogim@list.ru
// - Версия:    2.02
//  
////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда  
	
	#Область ПрограммныйИнтерфейс
		
		// Возвращает сведения о внешнем отчете.
		//
		// Возвращаемое значение:
		//   Структура - Подробнее см. ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке().
		//
		Функция СведенияОВнешнейОбработке() Экспорт
			
			МассивОбъектовНазначения = Новый Массив;
			//МассивОбъектовНазначения.Добавить("Документ.ПоступлениеТоваровУслуг"); 
			//МассивОбъектовНазначения.Добавить("Документ.*"); 
			
			ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("2.2.4.1");
			ПараметрыРегистрации.Наименование = ЭтотОбъект.Метаданные().Представление() +  " Иван (Ibrogim), Ibrogim@list.ru"; 
			
			ПараметрыJSON = новый Структура;
			ПараметрыJSON.Вставить("Вид"			,"Внешняя обработка (открытие формы)");
			ПараметрыJSON.Вставить("Наименование"	,ЭтотОбъект.Метаданные().Представление());
			ПараметрыJSON.Вставить("Создана"		,"20.07.2022");
			ПараметрыJSON.Вставить("Поставщик"		,"Иван (Ibrogim), Ibrogim@list.ru");
			ПараметрыJSON.Вставить("Конфигурация"	,Метаданные.Имя); // * сли все конфигурации
			
			ЗаписьJSON = Новый ЗаписьJSON;		
			ЗаписьJSON.УстановитьСтроку(); 		
			ЗаписатьJSON(ЗаписьJSON,ПараметрыJSON);			
			ПараметрыРегистрации.Информация =  ЗаписьJSON.Закрыть();  
			
			ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка();
			ПараметрыРегистрации.Версия = "1.0.0.1";
			ПараметрыРегистрации.ОпределитьНастройкиФормы = Истина; 
			ПараметрыРегистрации.Назначение		= МассивОбъектовНазначения;
			ПараметрыРегистрации.БезопасныйРежим 	= Ложь;
			
			Команда = ПараметрыРегистрации.Команды.Добавить();
			Команда.Представление = "Открыть " + ЭтотОбъект.Метаданные().Представление();
			Команда.Идентификатор = "ОткрытьФорму_" + ЭтотОбъект.Метаданные().Имя;
			Команда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
			Команда.ПоказыватьОповещение = Ложь;
						
			Возврат ПараметрыРегистрации;
						
		КонецФункции
			
		Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт

		КонецПроцедуры   
		
	#КонецОбласти

#КонецЕсли  
