
&НаКлиенте
Процедура КомандаОК(Команда)
	КомандаОКНаСервере();
	Если ВариантКоллекции = 0 Тогда 
		Текст = "<структура>";
	ИначеЕсли ВариантКоллекции = 1 Тогда	
		Текст = "<таблица>";
	ИначеЕсли ВариантКоллекции = 2 Тогда	
		Текст = "<список>";
	ИначеЕсли ВариантКоллекции = 3 Тогда	
		Текст = "<соответствие>";
	ИначеЕсли ВариантКоллекции = 4 Тогда	
		Текст = "<массив>";
	КонецЕсли;
		
	Закрыть(Текст);
КонецПроцедуры

&НаСервере
Процедура КомандаОКНаСервере()
	Перем Коллекция;
	
	Если ТаблицаСтруктура.Количество() Тогда 
		
		Коллекция = Новый Структура;
		Для каждого СтрокаТаблицы из ТаблицаСтруктура Цикл 
			Коллекция.Вставить(СтрокаТаблицы.Ключ, СтрокаТаблицы.Значение);
		КонецЦикла;
		
	ИначеЕсли ТаблицаПрограммно.Количество() Тогда
		Коллекция = ТаблицаПрограммно.Выгрузить();
		
	ИначеЕсли НастройкиСписок.Количество() Тогда
		
		Коллекция = НастройкиСписок;
		
	ИначеЕсли ТаблицаСоответствие.Количество() Тогда 
		
		Коллекция = Новый Соответствие;
		Для каждого СтрокаТаблицы из ТаблицаСоответствие Цикл 
			Коллекция.Вставить(СтрокаТаблицы.Ключ, СтрокаТаблицы.Значение);
		КонецЦикла;

	ИначеЕсли НастройкиМассив.Количество() Тогда 
		
		Коллекция = НастройкиМассив.ВыгрузитьЗначения();
		
	КонецЕсли;
	
	Если Коллекция <> Неопределено Тогда 
		ХранилищеОбщихНастроек.Сохранить(КлючОбъекта, КлючНастроек, Коллекция, , ИмяПользователя);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры, "ИмяПользователя, КлючНастроек, КлючОбъекта");
	Настройки = ХранилищеОбщихНастроек.Загрузить(КлючОбъекта, КлючНастроек, , ИмяПользователя);
	
	Если ТипЗнч(Настройки) = Тип("Структура") Тогда 
		Для каждого ЭлементКоллекции из Настройки Цикл 
			СтрокаТаблицы = ТаблицаСтруктура.Добавить();
			СтрокаТаблицы.Ключ = ЭлементКоллекции.Ключ;
			СтрокаТаблицы.Значение = ЭлементКоллекции.Значение;
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(Настройки) = Тип("ТаблицаЗначений") Тогда 
		
		ВариантКоллекции = 1;
		ПрограммноДобавитьРеквизитыТаблицы(Настройки.Колонки);
		
		ТаблицаПрограммно.Загрузить(Настройки);
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаТаблица;
		
	ИначеЕсли ТипЗнч(Настройки) = Тип("СписокЗначений") Тогда	
		
		ВариантКоллекции = 2;
		Для каждого ЭлементСписка из Настройки Цикл 
			НастройкиСписок.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление);
		КонецЦикла;
		
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСписокЗначений;
		
	ИначеЕсли ТипЗнч(Настройки) = Тип("Соответствие") Тогда 
		ВариантКоллекции = 3;
		Для каждого ЭлементКоллекции из Настройки Цикл 
			СтрокаТаблицы = ТаблицаСоответствие.Добавить();
			СтрокаТаблицы.Ключ = ЭлементКоллекции.Ключ;
			СтрокаТаблицы.Значение = ЭлементКоллекции.Значение;
		КонецЦикла;
		
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСоответствие;
		
	ИначеЕсли ТипЗнч(Настройки) = Тип("Массив") Тогда	
		
		ВариантКоллекции = 4;
		НастройкиМассив.ЗагрузитьЗначения(Настройки);
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаМассив;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПрограммноДобавитьРеквизитыТаблицы(Колонки)
	
	УдаляемыеРеквизиты = Новый Массив;
	Если Не ПустаяСтрока(АдресДобавленныеРеквизиты) Тогда 
		РанееДобавленныеРеквизиты = ПолучитьИзВременногоХранилища(АдресДобавленныеРеквизиты);
		Для каждого Реквизит из РанееДобавленныеРеквизиты Цикл 
			ПутьКДанным = "ТаблицаПрограммно."+ Реквизит.Имя;
			УдаляемыеРеквизиты.Добавить(ПутьКДанным);
			Элемент = Элементы.Найти(СтрЗаменить(ПутьКДанным, ".", ""));
			Если Элемент <> Неопределено Тогда 
				Элементы.Удалить(Элемент);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	ТаблицаПрограммно.Очистить();
	
	ДобавляемыеРеквизиты = Новый Массив;
	Для каждого Колонка из Колонки Цикл 
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(Колонка.Имя, Колонка.ТипЗначения, "ТаблицаПрограммно", Колонка.Заголовок));
	КонецЦикла;
	
	ИзменитьРеквизиты(ДобавляемыеРеквизиты, УдаляемыеРеквизиты);
	АдресДобавленныеРеквизиты = ПоместитьВоВременноеХранилище(ДобавляемыеРеквизиты, УникальныйИдентификатор);
	
	Для каждого Колонка из Колонки Цикл 
		НовыйЭлемент = Элементы.Добавить("ТаблицаПрограммно"+ Колонка.Имя, Тип("ПолеФормы"), Элементы.ТаблицаПрограммно);
		НовыйЭлемент.ПутьКДанным = "ТаблицаПрограммно."+ Колонка.Имя;
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ВариантКоллекцииПриИзменении(Элемент)
	
	Если ВариантКоллекции = 0 Тогда 
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтруктура;
	ИначеЕсли ВариантКоллекции = 1 Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаТаблица;
	ИначеЕсли ВариантКоллекции = 2 Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСписокЗначений;
	ИначеЕсли ВариантКоллекции = 3 Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСоответствие;
	ИначеЕсли ВариантКоллекции = 4 Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаМассив;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСтруктуруТаблицы(Команда)
	
	Если ТаблицаПрограммно.Количество() Тогда 
		ОписаниеОповещения = Новый ОписаниеОповещения("ИзменитьСтруктуруТаблицыВопросПродолжить", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения, "Данные в таблице будут очищены. Продолжить?",РежимДиалогаВопрос.ДаНет, 60);
	Иначе
		ИзменитьСтруктуруТаблицыПродолжение();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСтруктуруТаблицыВопросПродолжить(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ИзменитьСтруктуруТаблицыПродолжение();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСтруктуруТаблицыПродолжение()
	
	Оповещение = Новый ОписаниеОповещения("ИзменитьСтруктуруТаблицыЗавершение", ЭтотОбъект);
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТекущаяСтруктура", ОписаниеТекущейТаблицы());
	ОткрытьФорму("Обработка.ТБН_ОбщиеНастройки.Форма.ФормаОписаниеТаблицы", ПараметрыФормы, ЭтаФорма, , , , Оповещение);
	
	
КонецПроцедуры

&НаСервере
Функция ОписаниеТекущейТаблицы()
	
	ТЗ = ТаблицаПрограммно.Выгрузить();
	Массив = Новый Массив();
	Для каждого Колонка из ТЗ.Колонки Цикл 
		Структура = Новый Структура("Имя, ТипЗначения, Заголовок");
		Структура.Имя 			= Колонка.Имя;
		Структура.ТипЗначения 	= Колонка.ТипЗначения;
		Структура.Заголовок 	= Колонка.Заголовок;
		Массив.Добавить(Структура);
	КонецЦикла;
	
	Возврат Массив;
	
КонецФункции

&НаКлиенте
Процедура ИзменитьСтруктуруТаблицыЗавершение(Результат, ДополнительныеПараметры) Экспорт 
	
	Если Результат = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ПрограммноДобавитьРеквизитыТаблицы(Результат);
	
КонецПроцедуры
